# Built In Failures Analytical Automation Failures Class

Source: https://www.revitapidocs.com/2026/67575a54-3480-4906-a7b0-80865018e42e.htm

---

| Built In Failures Analytical Automation Failures Class |
| --- |

Failures about Analytical Automation. Inheritance Hierarchy System Object
Autodesk.Revit.DB BuiltInFailures AnalyticalAutomationFailures

**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static class AnalyticalAutomationFailures
```

```
Public NotInheritable Class AnalyticalAutomationFailures
```

```
public ref class AnalyticalAutomationFailures abstract sealed
```

```
[<AbstractClassAttribute>]
[<SealedAttribute>]
type AnalyticalAutomationFailures = class end
```
The BuiltInFailures AnalyticalAutomationFailures type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | EmptySelection | There are no selected elements. |

Top See Also

#### Reference

Autodesk.Revit.DB Namespace